'''
面向对象思想
'''

'''

软件编程实质：
软件编程就是将我们的思想转变成计算机能够识别语言的一个过程

什么是面向过程？
自上而下顺序执行，逐步求精
其程序结构是按功能划分为若干个基本模块，这是树状结构
各模块之间的关系尽可能简单，子啊功能上相对独立
每一模块内部均是由顺序，选择和循环三种基本机构
其模块化死心啊的具体方法是使用子程序
程序流程在写程序时就已决定

什么是面向对象？
把数据及对数据的操作方法放在一起，作为一个实体--对象
对同类对象抽象出其共性，形成类。
类中的大多数数据，只能用本类的方法进行处理
类通过一个简单的外部结构与外界发送关系，对象通过消息进行通信。
程序流程由用户在使用中决定

理解面向对象
面向对象是相对面向过程而言
面向对象和面向过程都是一种思想
面向过程
    强调的是功能行为
    关注的是解决问题需要哪些步骤
面向对象
    将功能封装进对象，强调具备了功能的对象
    关注的是解决问题需要哪些对象
面向对象是基于面向过程的

面向对象的特点
是一种符合人们思考习惯的思想
可以将复杂的事情简单化
将程序员从执行者换成了指挥者

完成需求时
    先要去找具有所需的功能的对象来用
    如果该对象不存在，那么创建一个具有所需功能的对象

类与对象的关系
    使用计算机语言就是不断的在描述现实生活中的事物
    Python中描述事物通过类的形式体现，类似具体事物概念上的定义
    对象即是该类事物实实在在存在的个体

类的定义
    生活中描述事物无非就是描述事物的名称/属性和行为
        如：人的身高，体重等属性，说话，走路等行为
    Python中用类来描述事物也是如此
        属性：对应类中的成员变量
        行为：对应类中的成员方法
    定义类其实在定义类中的成员(成员变量和成员方法)
    拥有相同(或者类似)属性和行为的对象都可以

类的设计
只关心3样东西
    事物名称(类名)：人（person）
    属性：身高(height),年龄(age)
    行为(功能):跑（run），打架(fight)














'''